In [1]:
import pandas as pd

#### 导入csv文件

In [2]:
df = pd.read_csv("excelTest.csv",encoding="utf-8")#创建文件的时候要在excel软件里面选择utf-8模式保存
df

   姓名  年龄   工作     薪水        入职日期
0  张三  30  CEO  50000   2010/3/11
1  李四  24   主管  30000   2018/8/19
2  王五  25   经理  40000  2015/10/11

#### 指定分隔符显示表格

In [3]:
df = pd.read_csv("excelTest.csv",encoding="utf-8",sep=' ')#使用sep选项指定分隔符
df

            姓名,年龄,工作,薪水,入职日期
0  张三,30,CEO,50000,2010/3/11
1   李四,24,主管,30000,2018/8/19
2  王五,25,经理,40000,2015/10/11

In [4]:
df = pd.read_csv("excelTest.csv",encoding="utf-8",sep='\t')#使用sep选项指定分隔符
df

            姓名,年龄,工作,薪水,入职日期
0  张三,30,CEO,50000,2010/3/11
1   李四,24,主管,30000,2018/8/19
2  王五,25,经理,40000,2015/10/11

#### 指定读取的行数

In [5]:
pd.read_csv("excelTest.csv",encoding="utf-8",nrows=2)#设置显示的行数

   姓名  年龄   工作     薪水       入职日期
0  张三  30  CEO  50000  2010/3/11
1  李四  24   主管  30000  2018/8/19

#### 指定读取的列数

In [6]:
pd.read_csv("excelTest.csv",encoding="utf-8",usecols=[1])#设置显示的列数 同样的这里也需要使用列表指定列数

   年龄
0  30
1  24
2  25

In [7]:
pd.read_csv("excelTest.csv",encoding="utf-8",usecols=[1,3])#读取并返回第一列与第三列

   年龄     薪水
0  30  50000
1  24  30000
2  25  40000

#### 欲读取的文件或者路径中有中文的的读取方法

In [8]:
#engine: %%python (valid options are "c", "python", or "python-fwf")
pd.read_csv("excelTest.csv",encoding="utf-8",engine="c")

   姓名  年龄   工作     薪水        入职日期
0  张三  30  CEO  50000   2010/3/11
1  李四  24   主管  30000   2018/8/19
2  王五  25   经理  40000  2015/10/11

In [9]:
pd.read_csv("excelTest.csv",encoding="utf-8",engine="python")

                         姓名
张三 30 CEO 50000   2010/3/11
李四 24 主管  30000   2018/8/19
王五 25 经理  40000  2015/10/11

In [10]:
pd.read_csv("excelTest.csv",encoding="utf-8",engine="python-fwf")

            姓名,年龄,工作,薪水,入职日期
0  张三,30,CEO,50000,2010/3/11
1   李四,24,主管,30000,2018/8/19
2  王五,25,经理,40000,2015/10/11